# SF SALARY ANALYSIS

# import the neccessary tools or library

In [1]:
import pandas as pd
import numpy as np

In [2]:
sal = pd.read_csv(r'C:\Users\Joshua Ayobami\Desktop\Joshua\DATA SCIENCE\REAL WORLD DATA REPOSITORY\Salaries.csv',error_bad_lines=None,dtype=None)

C:\Users\Joshua Ayobami\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [3]:
#check the dataframe
sal.head()

,,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:
sal.info() # find out how many entries

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0                     148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [5]:
sal.columns #to check for the header

Index(['    ', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay',
       'OtherPay', 'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes',
       'Agency', 'Status'],
      dtype='object')

In [6]:
sal.dtypes #it's very important to know the dtypes of dataset to know what to when using pandas operations

                      int64
EmployeeName         object
JobTitle             object
BasePay              object
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status               object
dtype: object

In [7]:
#'BasePay' is an object instead of either a float or int, so it must be corrected before using pandas operations

sal['BasePay'] = pd.to_numeric(sal['BasePay'],errors = 'coerce') #when coverting from object to int or float with dataframe

In [8]:
#what is the average basepay?
sal['BasePay'].mean()

66325.44884050643

In [9]:
#'OvertimePay' is an object instead of either a float or int, so it must be corrected before using pandas operations

sal['OvertimePay'] = pd.to_numeric(sal['OvertimePay'],errors = 'coerce') #when coverting from object to int or float with dataframe

#what is the highest amount of 'OvertimePay' in the DataSet

sal['OvertimePay'].max()

245131.88

# what is the jobtitle Of JOSEPH DRISCOLL not joseph driscoll?

In [10]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']

,,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [11]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [12]:
# how much does JOSEPH DRISCOLL earn (including benefits)?

sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

# what is the name of the hightest paid person?

In [13]:
print(f'highest paid is' ,sal['TotalPayBenefits'].max())

highest paid is 567595.43

In [14]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()] 

print(f'The name of the highest paid employee is', sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName'])

The name of the highest paid employee is 0    NATHANIEL FORD
Name: EmployeeName, dtype: object

# show the details of the highest paid person?

In [15]:
sal.iloc[sal['TotalPayBenefits'].argmax()] #sal.loc[sal['TotalPayBenefits'].idxmax()] can also be use

                                                                 1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

# show the details of the lowest paid person?
give a reason for this?

In [16]:
sal.iloc[sal['TotalPayBenefits'].argmin()]

                                        148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                    0.0
OvertimePay                                0.0
OtherPay                               -618.13
Benefits                                     0
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                      PT
Name: 148653, dtype: object

In [17]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

,,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0,-618.13,-618.13,2014,NaN,San Francisco,PT

In [18]:
sal.groupby('Year').mean()

,,BasePay,OvertimePay,TotalPay,TotalPayBenefits,Notes
Year,,,,,,
2011,18080.0,63595.956517,4531.065429,71744.103871,71744.103871,NaN
2012,54542.5,65436.406857,5023.417824,74113.262265,100553.229232,NaN
2013,91728.5,69630.030216,5281.641980,77611.443142,101440.519714,NaN
2014,129593.0,66564.421924,5401.993737,75463.918140,100250.918884,NaN

# what was the average(mean) BasePay per year of all employee from (2011-2014)?

In [19]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

# HOW MANY UNIQUE JOB TITLE ARE THERE?

In [20]:
sal['JobTitle'].nunique()

2159

In [21]:
sal.head()

,,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

# what are the top 5 most common job?

In [22]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

# how many job title were represented by only one person in 2013?

In [23]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts()==1)

202

# how many people have the word 'chief' in their job title?

In [24]:

def chief(JobTitle):
    if 'chief' in JobTitle.lower().split():
        return True
    else:
        return False
sum(sal['JobTitle'].apply(lambda x:chief(x)))

477

# check if there is correlation between the lenght of the job and salary?

In [25]:
sal['Title_len']=sal['JobTitle'].apply(len)

In [26]:
df = sal[['JobTitle','Title_len']]

In [27]:
df.head()

                                         JobTitle  Title_len
0  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY         46
1                 CAPTAIN III (POLICE DEPARTMENT)         31
2                 CAPTAIN III (POLICE DEPARTMENT)         31
3            WIRE ROPE CABLE MAINTENANCE MECHANIC         36
4    DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)         44

In [28]:
df.tail()

                          JobTitle  Title_len
148649                   Custodian          9
148650                Not provided         12
148651                Not provided         12
148652                Not provided         12
148653  Counselor, Log Cabin Ranch         26

In [29]:

df = sal[['TotalPayBenefits','Title_len']].corr()

In [30]:
print(df, '  no correlation')

                  TotalPayBenefits  Title_len
TotalPayBenefits          1.000000  -0.036878
Title_len                -0.036878   1.000000   no correlation

#